% 类别由人工统计出来
labels = zeros(400, 1);

% 第二组全部
labels(11:20) = 1;

% 第四组 1 2 3 8 9
labels(31:33) = 1;
labels(38:39) = 1;

% 第六组全部
labels(51:60) = 1;

% 第七组 4 5 10
labels(64:65) = 1;
labels(70) = 1;

% 第十三组 1 2 5 6 7 8 9 10
labels(121:122) = 1;
labels(125:130) = 1;

% 第十四组全部
labels(131:140) = 1;

% 第十七组 1 2 5 6 7 8 9 10
labels(161:162) = 1;
labels(165:170) = 1;

% 第十九组 1 2 3 6 10
labels(181:183) = 1;
labels(186) = 1;
labels(190) = 1;

% 第二十组 1 2 3 5 7 8 9 10
labels(191:193) = 1;
labels(195) = 1;
labels(197:200) = 1;

% 第二十七组全部
labels(261:270) = 1;

% 第二十八组全部
labels(271:280) = 1;

% 第三十一组全部
labels(301:310) = 1;

% 第三十四组全部
labels(331:340) = 1;

% 第三十六组 9 10
labels(359:360) = 1;

% 第三十七组全部
labels(361:370) = 1;

save('glass.mat', 'labels');


